/******************************************************************************
Чтение текстового файла
*******************************************************************************/
#include <stdio.h>
  
int main(void)
{
    char * filename = "file.txt";  // Имя файла
    char buffer[256]; // Буфер для временного хранения строки
    FILE *fp = fopen(filename, "r"); // Открываем файл для чтения
    
    if(fp) // Проверяем успешность открытия файла
    {
        while((fgets(buffer, 256, fp)) != NULL) // Пока не достигнут конец файла
        {
            printf("%s", buffer); // Выводим строку в консоль
        }
        fclose(fp); // Закрываем файл
    } 
    
    return 0;
}
